{
  "_name_or_path": "./build",
  "architectures": [
    "GPTNeoXModel"
  ],
  "attention_dropout": 0.0,
  "bos_token_id": 0,
  "classifier_dropout": 0.1,
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_dropout": 0.0,
  "hidden_size": 1000,
  "initializer_range": 0.02,
  "intermediate_size": 1000,
  "layer_norm_eps": 0.001,
  "max_position_embeddings": 2048,
  "model_type": "gpt_neox",
  "num_attention_heads": 10,
  "num_hidden_layers": 44,
  "rope_scaling": null,
  "rotary_emb_base": 1000,
  "rotary_pct": 0.25,
  "tie_word_embeddings": false,
  "torch_dtype": "float32",
  "transformers_version": "4.32.1",
  "use_cache": true,
  "use_parallel_residual": true,
  "vocab_size": 1000
}
